Revit 2024 API
BuiltInFailures.SketchFailures.LoopIntersectPath3d Property
 Lines cannot intersect each other. The highlighted lines currently intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId LoopIntersectPath3d { get; }
Visual Basic
Public Shared ReadOnly Property LoopIntersectPath3d As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ LoopIntersectPath3d {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace